Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K42A.tmx
Source language: en_us
Languages: zh_cn

source: A Man Like Him
zh_cn: 一个像他那样的男人（1）

source: The girl, unlike most people photographed for fashion magazines, was not beautiful.
zh_cn: 那个女孩并不美，不像大多数时尚杂志照片上的人那样。

source: Moreover, she had no desire to appear beautiful, as anyone looking at her could tell, and for that reason Teacher Fei stopped turning the pages and studied her.
zh_cn: 而且，任何人都能看得出来，她也无意表现出美，就是这一点让范老师停下翻动杂志来仔细看她。

source: She had short, unruly hair and wide-set eyes that glared at the camera in a closeup shot.
zh_cn: 她蓬乱的头发剪得很短，睁大眼睛看着近距离的镜头。

source: In another photo, she stood in front of a bedroom door, her back to the camera, her hand pushing the door ajar. A bed and its pink sheet were artfully blurred.
zh_cn: 在另外一张照片上，她站在卧室前背对着镜头，她的手正把卧室门推开，卧室里的床和粉红色床单很艺术地虚化了。

source: Her black T-shirt, in sharp focus, displayed a line of white printed characters: "My father is less of a creature than a pig or a dog because he is an adulterer."
zh_cn: 焦点里的她穿着黑色T恤，上面印着一行白色文字：我父亲是猪狗不如的奸夫。

source: The girl was nineteen, Teacher Fei learned from the article.
zh_cn: 范老师从文章中得知女孩十九岁，她的父母三年前离婚了。

source: Her parents had divorced three years earlier, and she suspected that another woman, a second cousin of her father's, had seduced him.
zh_cn: 她怀疑另外一个女人，即她父亲的二表妹勾引了父亲。

source: On her eighteenth birthday, the first day permitted by law, the daughter had filed a lawsuit against him.
zh_cn: 在她十八岁生日那一天，也就是法律允许她告状的第一天，她把父亲告上了法院。

source: As she explained to the reporter, he was a member of the Communist Party, and he should be punished for abandoning his family, and for the immoral act of taking a mistress in the first place.
zh_cn: 她对记者解释说，他是党员，尤其应该为抛弃家庭和豢养情妇的不道德行为受到惩罚。

source: When the effort to imprison her father failed, the girl started a blog and called it A Declaration of War on Unfaithful Husbands.
zh_cn: 当女孩把父亲送进监狱的努力失败后，她在网上开了一个名为“向不忠丈夫开战”的博客。

source: "What is it that this crazy girl wants?"
zh_cn: “这个疯狂的女孩到底想得到什么？”

source: Teacher Fei asked out loud before reaching the girl's answer.
zh_cn: 范老师在看到女孩的回答之前就大声问了出来。

source: She wanted her father to lose his job, she told the reporter, along with his social status, his freedom, if possible, and his mistress for sure; she wanted him to beg her and her mother to take him back.
zh_cn: 她要父亲失去工作，她告诉记者，假如可能的话，还有他的社会地位和人身自由，当然还有他的情妇；她要父亲乞求她和母亲准许他回家。

source: She would support him for the rest of his life as the most filial daughter, but he had to repent - and, before that, to suffer as much as she and her mother had.
zh_cn: 她要像其他孝顺女儿一样赡养他的余生，但是在此之前他必须忏悔，像她和母亲一样吃足苦头。

source: What malice, Teacher Fei thought.
zh_cn: 多么恶毒，范老师想。

source: He flung the magazine across the room, knocking a picture frame from the bookcase and surprising himself with this sudden burst of anger.
zh_cn: 他把杂志扔向房间另一边，还拍打了放在书架上的相框，他对自己突然爆发出来的愤怒感到奇怪。

source: At sixty-six, Teacher Fei had seen enough of the world to consider himself beyond the trap of pointless emotions.
zh_cn: 范老师今年六十六岁，已经见识过这个世界上大大小小的事情，以为自己不会再无谓地感情用事了。

source: Was it the milkman, his mother asked from the living room.
zh_cn: 是送牛奶的来了吗？他母亲从客厅里问道。

source: Milkmen had long ago ceased to exist in Beijing, milk being sold abundantly in stores now; still, approaching ninety, she was snatched from time to time by the old fear that a neighbor or a passerby would swipe their two rationed bottles.
zh_cn: 送奶工在北京早已经不存在了，现在牛奶都放在商店里卖。但是她母亲快要九十岁了，她不时害怕邻居或过路人会拿走他们家的两个奶瓶，她记得她们家有两次因为丢了奶瓶被罚钱。

source: Remember how they had twice been fined for lost bottles, she asked as Teacher Fei entered the living room, where she sat in the old armchair that had been his father's favorite spot in his last years.
zh_cn: 母亲要范老师到客厅里面去，她坐在一张扶手椅上，这是他父亲去世前喜欢坐的地方。

source: Teacher Fei hadn't listened closely, but it was a question he knew by heart, and he said yes, he had remembered to pick up the bottles the moment they were delivered.
zh_cn: 范老师并没有走近去听，他对母亲要说的话早就了然于心。他回答说好的，等奶一送过来他就会把奶瓶收好。

source: Be sure to leave them in a basin of cold water so the milk does not turn sour, she urged.
zh_cn: 不要忘了把奶瓶放在冷水里，这样奶不会馊，她督促着。

source: He stood before her and patted her hands, folded in her lap, and reassured her that there was no need for her to worry.
zh_cn: 他站在母亲身前拍拍她放在膝上的手，要她放心。

source: She grabbed him then, curling her thin fingers around his. "I have nothing to say about this world," she said slowly.
zh_cn: 母亲攥住他的手指，“对这个世界我已经无话可说了，”她慢慢说道。

source: "I know," Teacher Fei said.
zh_cn: “我知道，”范老师说。

source: He bent down and placed her hands back in her lap.
zh_cn: 他弯下腰去，把手放回她膝盖上。

source: "Should I warm some milk?" he asked, though he could see that already she was slipping away into her usual reverie, one that would momentarily wash her mind clean.
zh_cn: “我热一点牛奶好吗？”他问，尽管他看到母亲已经像往常一样陷入沉思中，这种沉思有时会让她片刻清醒起来。

source: Sometimes he made an effort, coaxing her to walk with baby steps to exercise her shrinking muscles.
zh_cn: 有时他设法哄劝她像小孩学步一样走路，这样可以锻炼她萎缩的肌肉。

source: A few years ago, the limit of her world had been the park two blocks down the street, and later the stone bench across the street from their apartment; now it was their fifth-floor balcony.
zh_cn: 几年前，她的世界已经局限于两排屋子那一边的公园，后来缩小到公寓楼对面街上的石凳，现在只是在他们家五楼的阳台上了。

source: Teacher Fei knew that in time he would let his mother die in peace in this apartment.
zh_cn: 范老师知道，他会让母亲在自己家里安详地逝去。

source: She disliked strangers, and he couldn't imagine her in a cold bed in a crowded hospital ward.
zh_cn: 她不喜欢陌生人，他不能想象把母亲送到拥挤的医院里，让她睡在冰冷的病床上。

source: Teacher Fei withdrew to the study, which had been his father's domain until his death.
zh_cn: 范老师退回到书房里，这里是父亲在世时的领地。

source: His mother had long ago stopped visiting this room, so Teacher Fei was the one who took care of the books on the shelves, airing the yellowing pages twice a year on the balcony, but inevitably some of the books had become too old to rescue, making way for the fashion magazines that Teacher Fei now purchased.
zh_cn: 母亲早就不再进入这间房间，所以是范老师来维护书架上的书籍，每年两次把那些发黄的书拿到阳台上吹吹风。有些书太旧了不能再用，就给范老师买来的时尚杂志让了路。

source: The black-clad girl taunted him from the magazine lying open on the floor.
zh_cn: 那本打开着躺在地板上的时尚杂志，上面的黑衣女孩激怒了范老师。

source: He picked her up and carefully set her on the desk, then fumbled in the drawer for an inkpot.
zh_cn: 他把她捡起来小心翼翼地放在书桌上，然后在抽屉里找墨水瓶。

source: Much of the ink in the bottle had evaporated from lack of use, and few of the brushes in the bamboo container were in good shape now.
zh_cn: 由于不太常用大部分墨水已经蒸发，竹筒里的几支毛笔却还保存得很好。

source: Still, with a fine brush pen and just enough ink on the tip, he was able to sketch a scorpion in the margin of the page, its pincers stabbing toward the girl's eyes.
zh_cn: 他用一支细毛笔蘸了墨水，在杂志的纸边上画了一只蝎子，蝎子的螯直刺女孩的眼睛。

source: It had been six years since he retired as an art teacher, nearly forty since he last painted out of free will.
zh_cn: 他从美术教师的位置上退休已经有六年，而离他上一次自由自在的泼墨挥毫，则已经有四十年了。

source: Teacher Fei looked at the drawing. His hand was far from a shaking old man's.
zh_cn: 范老师看着自己的画作，他的手还没有像老人那样颤抖。

source: He could have made the scorpion an arthropod version of the girl, but such an act would have been beneath his standards.
zh_cn: 他本来可以把女孩画成蝎子，但是这种把戏不是范老师的作为。

source: Teacher Fei had never cursed at a woman, either in words or in any other form of expression, and he certainly did not want to begin with a young girl.
zh_cn: 范老师从来不辱骂妇女，无论是用言语或其它方式，他当然不会为这么一个小女孩破了例。

source: Later, when Mrs. Luo, a neighbor in her late forties who had been laid off by the local electronics factory, came to sit with Teacher Fei's mother, he went to a nearby Internet cafe.
zh_cn: 后来，当邻居罗太太过来陪他母亲，他就去了附近网吧。罗太太不到五十岁，是本地电子厂的下岗工人。

source: It was a little after two, a slow time for the business, and the manager was dozing off in the warm sunshine.
zh_cn: 这时刚过两点，网吧里生意很清淡，老板在太阳下打着瞌睡。

source: A few middle-school students, not much older than twelve or thirteen, were gathered around a computer, talking in tones of hushed excitement, periodically breaking into giggles.
zh_cn: 有几个十二三岁的中学生挤在一台电脑前，用压低了的声音兴奋地说着话，不时发出吃吃的笑声。

source: Teacher Fei knew these types of kids. They pooled their pocket money in order to spend a few truant hours in a chat room, impersonating people much older than themselves and carrying on affairs with other human beings who could be equally fraudulent.
zh_cn: 范老师很了解这些孩子，他们把钱存起来花在聊天室里，装成大人和别人谈恋爱，那些别人当然也可能是假的。

source: In his school days, Teacher Fei had skipped his share of classes to frolic with friends in the spring meadow or to take long walks in the autumn woods, and he wondered if, in fifty years, the children around the computer would have to base their nostalgia on a fabricated world that existed only in a machine.
zh_cn: 范老师上学的时候会逃课和朋友们出去春游，或者在秋天到树林里去远足。他想，五十年后，当电脑边的那些孩子怀旧的时候，他们能想起的只有电脑里的虚拟世界。

source: But who could blame them for paying little attention to the beautiful April afternoon?
zh_cn: 但是谁能责备他们不去关心美丽的春天下午呢？

source: Teacher Fei had originally hired Mrs. Luo for an hour a day so that he could take a walk; ever since he had discovered the Internet, Mrs. Luo's hours had been increased.
zh_cn: 范老师起先花钱雇罗太太每天陪母亲一个小时，这样他可以到外面散步。自从他学会了上网以后，罗太太的工时增加了。

source: Most days now she spent three hours in the afternoon taking care of Teacher Fei's mother and cooking a meal for both of them.
zh_cn: 大多数日子罗太太下午在范老师家照顾母亲三个小时，还为他们两人做一顿饭。

source: The manager of the Internet cafe had once suggested that Teacher Fei purchase a computer of his own; the man had also volunteered to set it up, saying that he would be happy to see a good customer save money, even if it meant that he would lose some business.
zh_cn: 网吧老板曾建议范老师自己买一台电脑，还自告奋勇地帮范老师装机，说他看见老顾客能省钱很高兴，尽管他要少做一些生意。

source: Teacher Fei had rejected the generous offer - despite his mother's increasing loss of her grip on reality, he could not bring himself to perform any act of dishonesty in her presence.
zh_cn: 范老师回绝了老板的慷慨，尽管母亲越来越不能把握现实，只要母亲在，他就不能对她有所欺瞒。
